; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=318, out_folder=htg/blocksworld/training, instance_id=66, seed=2090, goal_proportion=0.03

(define (problem blocksworld-66)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 - object)
 (:init 
    (arm-empty)
    (clear b317)
    (on b317 b293)
    (on b293 b155)
    (on b155 b275)
    (on b275 b163)
    (on b163 b292)
    (on b292 b38)
    (on-table b38)
    (clear b301)
    (on b301 b192)
    (on b192 b230)
    (on b230 b84)
    (on b84 b30)
    (on b30 b140)
    (on b140 b35)
    (on b35 b95)
    (on b95 b78)
    (on b78 b159)
    (on b159 b232)
    (on b232 b174)
    (on b174 b181)
    (on b181 b98)
    (on b98 b62)
    (on b62 b162)
    (on b162 b89)
    (on-table b89)
    (clear b182)
    (on b182 b224)
    (on b224 b149)
    (on b149 b141)
    (on b141 b126)
    (on b126 b153)
    (on b153 b121)
    (on b121 b180)
    (on b180 b211)
    (on b211 b206)
    (on-table b206)
    (clear b119)
    (on-table b119)
    (clear b150)
    (on b150 b83)
    (on b83 b308)
    (on-table b308)
    (clear b286)
    (on b286 b245)
    (on b245 b303)
    (on b303 b135)
    (on b135 b1)
    (on b1 b270)
    (on-table b270)
    (clear b254)
    (on-table b254)
    (clear b257)
    (on b257 b222)
    (on b222 b102)
    (on b102 b220)
    (on b220 b88)
    (on b88 b158)
    (on b158 b50)
    (on b50 b137)
    (on b137 b96)
    (on b96 b64)
    (on b64 b203)
    (on b203 b57)
    (on b57 b300)
    (on-table b300)
    (clear b291)
    (on b291 b115)
    (on b115 b194)
    (on-table b194)
    (clear b151)
    (on b151 b170)
    (on b170 b7)
    (on b7 b107)
    (on b107 b240)
    (on-table b240)
    (clear b187)
    (on b187 b71)
    (on b71 b20)
    (on-table b20)
    (clear b277)
    (on b277 b87)
    (on b87 b178)
    (on b178 b273)
    (on b273 b268)
    (on-table b268)
    (clear b156)
    (on b156 b103)
    (on-table b103)
    (clear b68)
    (on-table b68)
    (clear b304)
    (on b304 b109)
    (on-table b109)
    (clear b147)
    (on b147 b101)
    (on b101 b154)
    (on-table b154)
    (clear b302)
    (on-table b302)
    (clear b298)
    (on-table b298)
    (clear b133)
    (on b133 b168)
    (on b168 b6)
    (on b6 b183)
    (on b183 b132)
    (on b132 b306)
    (on b306 b46)
    (on b46 b120)
    (on b120 b169)
    (on-table b169)
    (clear b97)
    (on b97 b173)
    (on b173 b146)
    (on b146 b289)
    (on-table b289)
    (clear b307)
    (on b307 b67)
    (on b67 b40)
    (on-table b40)
    (clear b116)
    (on b116 b309)
    (on b309 b49)
    (on b49 b47)
    (on b47 b2)
    (on b2 b34)
    (on b34 b37)
    (on-table b37)
    (clear b52)
    (on b52 b262)
    (on-table b262)
    (clear b201)
    (on-table b201)
    (clear b134)
    (on-table b134)
    (clear b190)
    (on b190 b69)
    (on-table b69)
    (clear b43)
    (on-table b43)
    (clear b209)
    (on b209 b161)
    (on b161 b263)
    (on-table b263)
    (clear b316)
    (on b316 b258)
    (on b258 b284)
    (on b284 b58)
    (on b58 b11)
    (on b11 b148)
    (on-table b148)
    (clear b202)
    (on b202 b165)
    (on b165 b21)
    (on b21 b144)
    (on b144 b253)
    (on-table b253)
    (clear b152)
    (on b152 b175)
    (on b175 b310)
    (on b310 b66)
    (on-table b66)
    (clear b315)
    (on b315 b208)
    (on b208 b48)
    (on b48 b221)
    (on b221 b225)
    (on b225 b139)
    (on b139 b113)
    (on b113 b36)
    (on b36 b214)
    (on b214 b45)
    (on b45 b60)
    (on b60 b136)
    (on-table b136)
    (clear b28)
    (on b28 b236)
    (on b236 b118)
    (on b118 b244)
    (on b244 b63)
    (on b63 b195)
    (on b195 b123)
    (on b123 b246)
    (on b246 b242)
    (on-table b242)
    (clear b22)
    (on b22 b5)
    (on-table b5)
    (clear b129)
    (on b129 b55)
    (on b55 b260)
    (on b260 b305)
    (on b305 b191)
    (on b191 b250)
    (on b250 b81)
    (on b81 b77)
    (on b77 b213)
    (on b213 b189)
    (on b189 b198)
    (on b198 b26)
    (on b26 b212)
    (on b212 b266)
    (on b266 b207)
    (on-table b207)
    (clear b27)
    (on-table b27)
    (clear b227)
    (on b227 b79)
    (on-table b79)
    (clear b143)
    (on b143 b108)
    (on b108 b72)
    (on-table b72)
    (clear b249)
    (on b249 b229)
    (on-table b229)
    (clear b31)
    (on b31 b312)
    (on b312 b73)
    (on-table b73)
    (clear b261)
    (on b261 b92)
    (on b92 b160)
    (on b160 b295)
    (on-table b295)
    (clear b44)
    (on b44 b184)
    (on b184 b252)
    (on b252 b274)
    (on b274 b179)
    (on b179 b13)
    (on b13 b287)
    (on-table b287)
    (clear b216)
    (on b216 b299)
    (on-table b299)
    (clear b76)
    (on-table b76)
    (clear b171)
    (on b171 b290)
    (on b290 b130)
    (on b130 b41)
    (on-table b41)
    (clear b12)
    (on b12 b259)
    (on b259 b56)
    (on b56 b10)
    (on b10 b18)
    (on-table b18)
    (clear b267)
    (on b267 b255)
    (on b255 b235)
    (on b235 b318)
    (on-table b318)
    (clear b311)
    (on b311 b237)
    (on b237 b210)
    (on b210 b297)
    (on b297 b131)
    (on-table b131)
    (clear b85)
    (on b85 b61)
    (on b61 b138)
    (on b138 b228)
    (on b228 b4)
    (on b4 b124)
    (on b124 b234)
    (on b234 b205)
    (on b205 b93)
    (on b93 b80)
    (on-table b80)
    (clear b29)
    (on-table b29)
    (clear b106)
    (on b106 b125)
    (on-table b125)
    (clear b279)
    (on b279 b114)
    (on b114 b99)
    (on b99 b74)
    (on b74 b271)
    (on b271 b172)
    (on b172 b16)
    (on b16 b243)
    (on-table b243)
    (clear b82)
    (on b82 b233)
    (on-table b233)
    (clear b276)
    (on b276 b90)
    (on b90 b204)
    (on b204 b25)
    (on-table b25)
    (clear b176)
    (on b176 b42)
    (on b42 b217)
    (on b217 b231)
    (on b231 b110)
    (on b110 b145)
    (on-table b145)
    (clear b65)
    (on b65 b226)
    (on b226 b23)
    (on b23 b269)
    (on-table b269)
    (clear b296)
    (on b296 b75)
    (on-table b75)
    (clear b32)
    (on b32 b294)
    (on-table b294)
    (clear b9)
    (on b9 b91)
    (on b91 b288)
    (on b288 b197)
    (on b197 b265)
    (on b265 b111)
    (on b111 b199)
    (on b199 b281)
    (on b281 b24)
    (on b24 b54)
    (on b54 b239)
    (on b239 b251)
    (on b251 b157)
    (on b157 b164)
    (on b164 b185)
    (on b185 b59)
    (on b59 b105)
    (on b105 b51)
    (on-table b51)
    (clear b247)
    (on b247 b313)
    (on-table b313)
    (clear b166)
    (on b166 b218)
    (on b218 b142)
    (on b142 b3)
    (on b3 b127)
    (on b127 b314)
    (on b314 b94)
    (on b94 b14)
    (on b14 b122)
    (on-table b122)
    (clear b15)
    (on-table b15)
    (clear b193)
    (on b193 b264)
    (on-table b264)
    (clear b112)
    (on b112 b238)
    (on b238 b188)
    (on b188 b219)
    (on b219 b39)
    (on b39 b17)
    (on b17 b282)
    (on b282 b19)
    (on b19 b272)
    (on b272 b117)
    (on b117 b223)
    (on-table b223)
    (clear b285)
    (on b285 b248)
    (on-table b248)
    (clear b177)
    (on-table b177)
    (clear b215)
    (on-table b215)
    (clear b53)
    (on b53 b200)
    (on-table b200)
    (clear b86)
    (on b86 b167)
    (on-table b167)
    (clear b283)
    (on-table b283)
    (clear b278)
    (on b278 b256)
    (on b256 b104)
    (on b104 b100)
    (on b100 b33)
    (on b33 b196)
    (on b196 b70)
    (on b70 b8)
    (on-table b8)
    (clear b280)
    (on-table b280)
    (clear b241)
    (on b241 b186)
    (on-table b186)
    (clear b128)
    (on-table b128))
 (:goal  (and 
    (clear b5)
    (on b5 b4)
    (on b4 b1)
    (on b1 b3)
    (on b3 b7)
    (on-table b7)
    (clear b8)
    (on-table b8)
    (clear b9)
    (on-table b9)
    (clear b2)
    (on b2 b6)
    (on-table b6))))

; plan
1. (unstack b9 b91)
   deleted: (on b9 b91) (clear b9) (arm-empty)
   added: (holding b9) (clear b91)
   goals met: 1 of 13
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 13
3. (unstack b116 b309)
   deleted: (on b116 b309) (clear b116) (arm-empty)
   added: (holding b116) (clear b309)
   goals met: 3 of 13
4. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 3 of 13
5. (unstack b133 b168)
   deleted: (on b133 b168) (clear b133) (arm-empty)
   added: (holding b133) (clear b168)
   goals met: 3 of 13
6. (putdown b133)
   deleted: (holding b133)
   added: (clear b133) (arm-empty) (on-table b133)
   goals met: 3 of 13
7. (unstack b151 b170)
   deleted: (on b151 b170) (clear b151) (arm-empty)
   added: (holding b151) (clear b170)
   goals met: 3 of 13
8. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 3 of 13
9. (unstack b166 b218)
   deleted: (on b166 b218) (clear b166) (arm-empty)
   added: (holding b166) (clear b218)
   goals met: 3 of 13
10. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 3 of 13
11. (unstack b168 b6)
   deleted: (on b168 b6) (clear b168) (arm-empty)
   added: (holding b168) (clear b6)
   goals met: 3 of 13
12. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 3 of 13
13. (unstack b6 b183)
   deleted: (on b6 b183) (clear b6) (arm-empty)
   added: (holding b6) (clear b183)
   goals met: 3 of 13
14. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 4 of 13
15. (unstack b170 b7)
   deleted: (on b170 b7) (clear b170) (arm-empty)
   added: (holding b170) (clear b7)
   goals met: 4 of 13
16. (putdown b170)
   deleted: (holding b170)
   added: (clear b170) (arm-empty) (on-table b170)
   goals met: 4 of 13
17. (unstack b7 b107)
   deleted: (on b7 b107) (clear b7) (arm-empty)
   added: (holding b7) (clear b107)
   goals met: 4 of 13
18. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 13
19. (unstack b218 b142)
   deleted: (on b218 b142) (clear b218) (arm-empty)
   added: (holding b218) (clear b142)
   goals met: 5 of 13
20. (putdown b218)
   deleted: (holding b218)
   added: (clear b218) (arm-empty) (on-table b218)
   goals met: 5 of 13
21. (unstack b142 b3)
   deleted: (on b142 b3) (clear b142) (arm-empty)
   added: (holding b142) (clear b3)
   goals met: 5 of 13
22. (putdown b142)
   deleted: (holding b142)
   added: (clear b142) (arm-empty) (on-table b142)
   goals met: 5 of 13
23. (unstack b22 b5)
   deleted: (on b22 b5) (clear b22) (arm-empty)
   added: (holding b22) (clear b5)
   goals met: 6 of 13
24. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 6 of 13
25. (unstack b278 b256)
   deleted: (on b278 b256) (clear b278) (arm-empty)
   added: (holding b278) (clear b256)
   goals met: 6 of 13
26. (putdown b278)
   deleted: (holding b278)
   added: (clear b278) (arm-empty) (on-table b278)
   goals met: 6 of 13
27. (unstack b256 b104)
   deleted: (on b256 b104) (clear b256) (arm-empty)
   added: (holding b256) (clear b104)
   goals met: 6 of 13
28. (putdown b256)
   deleted: (holding b256)
   added: (clear b256) (arm-empty) (on-table b256)
   goals met: 6 of 13
29. (unstack b104 b100)
   deleted: (on b104 b100) (clear b104) (arm-empty)
   added: (holding b104) (clear b100)
   goals met: 6 of 13
30. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 6 of 13
31. (unstack b100 b33)
   deleted: (on b100 b33) (clear b100) (arm-empty)
   added: (holding b100) (clear b33)
   goals met: 6 of 13
32. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 6 of 13
33. (unstack b286 b245)
   deleted: (on b286 b245) (clear b286) (arm-empty)
   added: (holding b286) (clear b245)
   goals met: 6 of 13
34. (putdown b286)
   deleted: (holding b286)
   added: (clear b286) (arm-empty) (on-table b286)
   goals met: 6 of 13
35. (unstack b245 b303)
   deleted: (on b245 b303) (clear b245) (arm-empty)
   added: (holding b245) (clear b303)
   goals met: 6 of 13
36. (putdown b245)
   deleted: (holding b245)
   added: (clear b245) (arm-empty) (on-table b245)
   goals met: 6 of 13
37. (unstack b303 b135)
   deleted: (on b303 b135) (clear b303) (arm-empty)
   added: (holding b303) (clear b135)
   goals met: 6 of 13
38. (putdown b303)
   deleted: (holding b303)
   added: (clear b303) (arm-empty) (on-table b303)
   goals met: 6 of 13
39. (unstack b135 b1)
   deleted: (on b135 b1) (clear b135) (arm-empty)
   added: (holding b135) (clear b1)
   goals met: 6 of 13
40. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 6 of 13
41. (unstack b309 b49)
   deleted: (on b309 b49) (clear b309) (arm-empty)
   added: (holding b309) (clear b49)
   goals met: 6 of 13
42. (putdown b309)
   deleted: (holding b309)
   added: (clear b309) (arm-empty) (on-table b309)
   goals met: 6 of 13
43. (unstack b33 b196)
   deleted: (on b33 b196) (clear b33) (arm-empty)
   added: (holding b33) (clear b196)
   goals met: 6 of 13
44. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 6 of 13
45. (unstack b196 b70)
   deleted: (on b196 b70) (clear b196) (arm-empty)
   added: (holding b196) (clear b70)
   goals met: 6 of 13
46. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 6 of 13
47. (unstack b49 b47)
   deleted: (on b49 b47) (clear b49) (arm-empty)
   added: (holding b49) (clear b47)
   goals met: 6 of 13
48. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 6 of 13
49. (unstack b47 b2)
   deleted: (on b47 b2) (clear b47) (arm-empty)
   added: (holding b47) (clear b2)
   goals met: 7 of 13
50. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 7 of 13
51. (unstack b70 b8)
   deleted: (on b70 b8) (clear b70) (arm-empty)
   added: (holding b70) (clear b8)
   goals met: 8 of 13
52. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 8 of 13
53. (unstack b85 b61)
   deleted: (on b85 b61) (clear b85) (arm-empty)
   added: (holding b85) (clear b61)
   goals met: 8 of 13
54. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 8 of 13
55. (unstack b61 b138)
   deleted: (on b61 b138) (clear b61) (arm-empty)
   added: (holding b61) (clear b138)
   goals met: 8 of 13
56. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 8 of 13
57. (unstack b138 b228)
   deleted: (on b138 b228) (clear b138) (arm-empty)
   added: (holding b138) (clear b228)
   goals met: 8 of 13
58. (putdown b138)
   deleted: (holding b138)
   added: (clear b138) (arm-empty) (on-table b138)
   goals met: 8 of 13
59. (unstack b228 b4)
   deleted: (on b228 b4) (clear b228) (arm-empty)
   added: (holding b228) (clear b4)
   goals met: 8 of 13
60. (putdown b228)
   deleted: (holding b228)
   added: (clear b228) (arm-empty) (on-table b228)
   goals met: 8 of 13
61. (unstack b3 b127)
   deleted: (on b3 b127) (clear b3) (arm-empty)
   added: (holding b3) (clear b127)
   goals met: 8 of 13
62. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 9 of 13
63. (unstack b1 b270)
   deleted: (on b1 b270) (clear b1) (arm-empty)
   added: (holding b1) (clear b270)
   goals met: 9 of 13
64. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 10 of 13
65. (unstack b4 b124)
   deleted: (on b4 b124) (clear b4) (arm-empty)
   added: (holding b4) (clear b124)
   goals met: 10 of 13
66. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 11 of 13
67. (unstack b2 b34)
   deleted: (on b2 b34) (clear b2) (arm-empty)
   added: (holding b2) (clear b34)
   goals met: 10 of 13
68. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 12 of 13
69. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 11 of 13
70. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 13 of 13
